In [1]:
import pandas as pd # Package to work with data

import numpy as np # Numerical analysis package

C:\Users\Pandey\AppData\Local\Temp\ipykernel_20148\2369098302.py:1: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd # Package to work with data

In [2]:
df = pd.read_csv('https://raw.githubusercontent.com/juanklopper/TutorialData/main/PUBH1142Chap0801.csv')

In [3]:
# Type of df
type(df)

pandas.core.frame.DataFrame

In [4]:
# Print the first 20 methods and attributes of df suing the dir function
dir(df)[:20]

['Age',
 'CholesterolAfter',
 'CholesterolBefore',
 'DOB',
 'Delta',
 'Group',
 'HR',
 'Name',
 'Smoke',
 'Survey',
 'T',
 'TAG',
 'Vocation',
 '_AXIS_LEN',
 '_AXIS_ORDERS',
 '_AXIS_TO_AXIS_NUMBER',
 '_HANDLED_TYPES',
 '__abs__',
 '__add__',
 '__and__']

In [8]:
# Use the head method to print the first 5 rows of df
df.head()

,Name,DOB,Age,Vocation,Smoke,HR,sBP,CholesterolBefore,TAG,Survey,CholesterolAfter,Delta,Group
0,Dylan Patton,1981-10-07,43,Energy manager,0,47,145,1.2,1.2,1,0.7,0.5,Active
1,Sandra Howard,1993-01-27,53,Tax adviser,0,51,115,1.2,0.6,3,1.0,0.2,Active
2,Samantha Williams,1973-12-21,33,IT consultant,0,54,120,2.0,1.3,3,1.7,0.3,Active
3,Ashley Hensley,1981-12-01,43,"Nurse, children's",0,54,103,2.1,1.6,4,2.1,0.0,Active
4,Robert Wilson,1964-06-23,46,Clinical embryologist,0,61,138,2.8,2.1,5,2.8,0.0,Active

In [9]:
# Print the shape of df
df.shape

(200, 13)

In [10]:
# Print the columns of df
df.columns

Index(['Name', 'DOB', 'Age', 'Vocation', 'Smoke', 'HR', 'sBP',
       'CholesterolBefore', 'TAG', 'Survey', 'CholesterolAfter', 'Delta',
       'Group'],
      dtype='object')

In [11]:
# Print the dimensions of df
df.ndim

2

In [12]:
# Print the size of df
df.size

2600

In [13]:
# Print the type of df
df.dtypes

Name                  object
DOB                   object
Age                    int64
Vocation              object
Smoke                  int64
HR                     int64
sBP                    int64
CholesterolBefore    float64
TAG                  float64
Survey                 int64
CholesterolAfter     float64
Delta                float64
Group                 object
dtype: object

## Selecting Rows and Columns

In [14]:
# Assign the Age column in df to the variable age_column
age_column = df['Age']

In [15]:
# Print the type of age_column
type(age_column)

pandas.core.series.Series

In [16]:
# Assign the Age column in df to the variable age_column and use dot notation
age_column = df.Age

In [17]:
age_column.head()

0    43
1    53
2    33
3    43
4    46
Name: Age, dtype: int64

In [18]:
vocation = df.Vocation
type(vocation)

pandas.core.series.Series

In [19]:
vocation.tail()

195            Sales professional, IT
196                         Paramedic
197    Chartered certified accountant
198                            Dancer
199                Theme park manager
Name: Vocation, dtype: object

In [20]:
# Convert the age_column to a numpy array and assign it to the variable age
age = age_column.to_numpy()

In [21]:
# Print the type of age
type(age)

numpy.ndarray

In [22]:
# Calculate the average age in age_column
age_column.mean()

53.07

In [23]:
# Calculate the minimum age in age_column
age_column.min()

30

In [24]:
# Calculate the maximum age in age_column
age_column.max()

75

In [25]:
# Display the first row of data in df using the iloc method
df.iloc[0] # Note the use of square brackets

Name                   Dylan Patton
DOB                      1981-10-07
Age                              43
Vocation             Energy manager
Smoke                             0
HR                               47
sBP                             145
CholesterolBefore               1.2
TAG                             1.2
Survey                            1
CholesterolAfter                0.7
Delta                           0.5
Group                        Active
Name: 0, dtype: object

In [26]:
# Select rows 2, 5, and 7 using the iloc method
df.iloc[[1, 4, 6]]

,Name,DOB,Age,Vocation,Smoke,HR,sBP,CholesterolBefore,TAG,Survey,CholesterolAfter,Delta,Group
1,Sandra Howard,1993-01-27,53,Tax adviser,0,51,115,1.2,0.6,3,1.0,0.2,Active
4,Robert Wilson,1964-06-23,46,Clinical embryologist,0,61,138,2.8,2.1,5,2.8,0.0,Active
6,Frank Zimmerman,1981-03-04,54,Police officer,0,60,129,2.9,2.4,1,2.6,0.3,Active

In [27]:
# Select the first two rows using the iloc method
df.iloc[0:2]

,Name,DOB,Age,Vocation,Smoke,HR,sBP,CholesterolBefore,TAG,Survey,CholesterolAfter,Delta,Group
0,Dylan Patton,1981-10-07,43,Energy manager,0,47,145,1.2,1.2,1,0.7,0.5,Active
1,Sandra Howard,1993-01-27,53,Tax adviser,0,51,115,1.2,0.6,3,1.0,0.2,Active

In [28]:
# Select the first two rows using the iloc method
df.iloc[:2]

,Name,DOB,Age,Vocation,Smoke,HR,sBP,CholesterolBefore,TAG,Survey,CholesterolAfter,Delta,Group
0,Dylan Patton,1981-10-07,43,Energy manager,0,47,145,1.2,1.2,1,0.7,0.5,Active
1,Sandra Howard,1993-01-27,53,Tax adviser,0,51,115,1.2,0.6,3,1.0,0.2,Active

In [29]:
# Select the last three rows
df.iloc[-3:]

,Name,DOB,Age,Vocation,Smoke,HR,sBP,CholesterolBefore,TAG,Survey,CholesterolAfter,Delta,Group
197,Charles Smith,1959-01-30,61,Chartered certified accountant,0,99,212,10.1,5.6,4,9.7,0.4,Control
198,Barry Porter,1979-05-30,65,Dancer,1,98,200,10.1,5.3,3,10.0,0.1,Control
199,Julie Barrett,1972-07-27,66,Theme park manager,1,102,208,11.1,5.7,2,10.7,0.4,Active

In [30]:
# Extract the first 5 rows for the first and third columns using the iloc method
df.iloc[:5, [0, 2]]

                Name  Age
0       Dylan Patton   43
1      Sandra Howard   53
2  Samantha Williams   33
3     Ashley Hensley   43
4      Robert Wilson   46

In [31]:
# Extract the first five rows for the Name and Age colunms using the loc method
df.loc[:4, ['Name', 'Age']] # Note the difference in row index compared to the iloc method

                Name  Age
0       Dylan Patton   43
1      Sandra Howard   53
2  Samantha Williams   33
3     Ashley Hensley   43
4      Robert Wilson   46

In [32]:
df.loc[10:15, ['TAG', 'Smoke']]

    TAG  Smoke
10  1.7      0
11  2.0      0
12  2.3      0
13  2.1      0
14  2.4      0
15  2.6      2

In [33]:
# Extract the value in row 2, column 1 using the iat method
df.iat[1, 0]

'Sandra Howard'

## Filtering Data

In [34]:
# Print the unique values in the Smoke column
df.Smoke.unique()

array([0, 2, 1], dtype=int64)

In [35]:
# Select the ages of those who do not smoke and assign it to the variable age_nonsmokers (as a numpy array)
age_nonsmokers = df.loc[df.Smoke == 0]['Age'].to_numpy()
age_nonsmokers # Print the numpy array to the screen

array([43, 53, 33, 43, 46, 48, 54, 58, 44, 31, 45, 35, 49, 56, 57, 35, 50,
       49, 63, 45, 51, 40, 47, 41, 47, 38, 54, 30, 46, 64, 40, 45, 65, 55,
       53, 54, 72, 32, 38, 59, 53, 42, 38, 51, 37, 36, 48, 49, 62, 39, 74,
       42, 72, 61, 33, 30, 44, 71, 49, 75, 43, 55, 38, 36, 46, 60, 57, 69,
       56, 66, 60, 42, 32, 31, 56, 35, 63, 54, 68, 72, 40, 54, 62, 74, 62,
       41, 61, 61], dtype=int64)

In [36]:
# Use the loc method to select the ages of those who do not smoke and assign it to the variable age_nonsmokers (as a numpy array)
age_nonsmokers = df.loc[df.Smoke == 0, 'Age'].to_numpy()
age_nonsmokers

array([43, 53, 33, 43, 46, 48, 54, 58, 44, 31, 45, 35, 49, 56, 57, 35, 50,
       49, 63, 45, 51, 40, 47, 41, 47, 38, 54, 30, 46, 64, 40, 45, 65, 55,
       53, 54, 72, 32, 38, 59, 53, 42, 38, 51, 37, 36, 48, 49, 62, 39, 74,
       42, 72, 61, 33, 30, 44, 71, 49, 75, 43, 55, 38, 36, 46, 60, 57, 69,
       56, 66, 60, 42, 32, 31, 56, 35, 63, 54, 68, 72, 40, 54, 62, 74, 62,
       41, 61, 61], dtype=int64)

In [37]:
# Use the loc method to select the ages of those who do not smoke and assign it to the variable age_nonsmokers
age_nonsmokers = df.loc[df.Smoke == 0, 'Age']
age_nonsmokers

0      43
1      53
2      33
3      43
4      46
       ..
180    74
183    62
188    41
193    61
197    61
Name: Age, Length: 88, dtype: int64

In [38]:
# Calculate the average age of those who do not smoke
age_nonsmokers.mean()

50.09090909090909

In [39]:
df.loc[df.HR > 72, 'Age'].to_list()[:10]

[57, 52, 49, 70, 45, 53, 50, 33, 30, 44]

In [40]:
# Filter by Smoke == 0 or Survey > 3 and assign the filter to the variable crit
crit = (df.Smoke == 0) | (df.Survey > 3)

In [41]:
# Use the crit criterium and assign to the variable nonsmoker_or_survey_gt_3
nonsmoker_or_survey_gt_3 = df.loc[crit, 'Age']
nonsmoker_or_survey_gt_3[:5] # Print the first 5 rows

0    43
1    53
2    33
3    43
4    46
Name: Age, dtype: int64

In [42]:
selection = (df.Smoke == 0) & (df.HR < 80) & (df.sBP < 120)
df.loc[selection, ['Age', 'TAG']].to_numpy

<bound method DataFrame.to_numpy of     Age  TAG
1    53  0.6
3    43  1.6
8    44  2.4
11   35  2.0
21   45  2.1
41   55  3.1>

In [43]:
# Create a new dataframe object that only contains participants younger than 50 and assign it to the variable df_younger_than_50
df_younger_than_50 = df.loc[df.Age < 50]
df_younger_than_50[:5] # Display the first five rows

,Name,DOB,Age,Vocation,Smoke,HR,sBP,CholesterolBefore,TAG,Survey,CholesterolAfter,Delta,Group
0,Dylan Patton,1981-10-07,43,Energy manager,0,47,145,1.2,1.2,1,0.7,0.5,Active
2,Samantha Williams,1973-12-21,33,IT consultant,0,54,120,2.0,1.3,3,1.7,0.3,Active
3,Ashley Hensley,1981-12-01,43,"Nurse, children's",0,54,103,2.1,1.6,4,2.1,0.0,Active
4,Robert Wilson,1964-06-23,46,Clinical embryologist,0,61,138,2.8,2.1,5,2.8,0.0,Active
5,Leslie Diaz,1994-08-25,48,Politician's assistant,0,59,122,2.8,1.4,4,2.6,0.2,Active

In [44]:
# Mean HR
df_younger_than_50.HR.mean()

69.45348837209302

In [45]:
# Create a Python list object with the string element 'IT consultant', 'Energy manager', 'Clinical embryologist' and assign it to the variable jobs
jobs = ['IT consultant', 'Energy manager', 'Clinical embryologist']

In [46]:
# Create a criterium
crit = df.Vocation.isin(jobs)

In [47]:
# Filter for job in the Vocation column and assign it to the variable df_jobs
df_jobs = df.loc[crit]
df_jobs

,Name,DOB,Age,Vocation,Smoke,HR,sBP,CholesterolBefore,TAG,Survey,CholesterolAfter,Delta,Group
0,Dylan Patton,1981-10-07,43,Energy manager,0,47,145,1.2,1.2,1,0.7,0.5,Active
2,Samantha Williams,1973-12-21,33,IT consultant,0,54,120,2.0,1.3,3,1.7,0.3,Active
4,Robert Wilson,1964-06-23,46,Clinical embryologist,0,61,138,2.8,2.1,5,2.8,0.0,Active
188,Joan Chavez,1999-10-07,41,Energy manager,0,93,182,9.1,5.0,2,8.8,0.3,Control

In [48]:
# Build a criterium with the str.contains method for the word manager
crit = df.Vocation.str.contains('manager', na=False) # Flag for missing values (see later)

In [49]:
# Create a new dataframe object with the criterium and assign it to the variable df_manager
df_manager = df.loc[crit]
df_manager[:5]

,Name,DOB,Age,Vocation,Smoke,HR,sBP,CholesterolBefore,TAG,Survey,CholesterolAfter,Delta,Group
0,Dylan Patton,1981-10-07,43,Energy manager,0,47,145,1.2,1.2,1,0.7,0.5,Active
34,Mr. Tyler Strickland DDS,1940-08-27,46,Tourist information centre manager,0,62,136,4.1,2.3,2,3.8,0.3,Control
54,Stephanie Jacobs,1977-06-18,38,Estate manager/land agent,0,69,139,4.4,2.7,2,4.0,0.4,Active
55,Juan Johnson,1956-12-09,51,Logistics and distribution manager,0,65,141,4.5,2.9,5,4.0,0.5,Control
71,Tina Martinez,1941-05-31,74,Passenger transport manager,1,69,146,4.8,3.1,4,4.5,0.3,Active

## Renaming Columns

In [50]:
# Replace the Name column with the Patient
df.rename(columns={'Name': 'Patient'}, inplace=True)
df.columns # Call the column names

Index(['Patient', 'DOB', 'Age', 'Vocation', 'Smoke', 'HR', 'sBP',
       'CholesterolBefore', 'TAG', 'Survey', 'CholesterolAfter', 'Delta',
       'Group'],
      dtype='object')

## Deleting Columns

In [51]:
# Delete the Delta column
df.drop(columns='Delta', inplace=True)

## Add a value of 2 to the age of each participant

In [52]:
# Add 2 to each value in the Age column
df.Age = df.Age + 2 # Note that the Age column is reassigned
df.Age[:5] # Display the first five rows

0    45
1    55
2    35
3    45
4    48
Name: Age, dtype: int64

In [53]:
# Create a user-defined function named add2 that adds 2 to a value
def add2(x):
    return x + 2

In [54]:
# Apply the add2 function to the Age column
df.Age = df.Age.apply(add2)
df.Age[:5]

0    47
1    57
2    37
3    47
4    50
Name: Age, dtype: int64

In [55]:
df['AgeHR'] = df.Age * df.HR

## Changing values in a column

In [57]:
# Return the unique values in the group column 
df.Group.unique()

array(['Active', 'Control'], dtype=object)

In [60]:
# Use the replace method to replace the values in the Group column with 1 for Active and 0 for Control
df.Group.replace({'Active': 1, 'Control': 0}, inplace=True)

In [59]:
# Print the first 5 rows of the Group column
df.Group[:5]

0    1
1    1
2    1
3    1
4    1
Name: Group, dtype: int64

## Splitting the values in a column into two columns

In [61]:
# Split the values in the Patient column on the empty space between the first and last names and assign it to the variable split_participant
split_participant = df.Patient.str.split(' ', expand=True)

In [62]:
# Create new columns in df named FirstName and LastName
df['FirstName'] = split_participant[0]
df['LastName'] = split_participant[1]

In [63]:
# Print first 5 rows of FirstName and LastName and Patient
df[['FirstName', 'LastName', 'Patient']][:5]

  FirstName  LastName            Patient
0     Dylan    Patton       Dylan Patton
1    Sandra    Howard      Sandra Howard
2  Samantha  Williams  Samantha Williams
3    Ashley   Hensley     Ashley Hensley
4    Robert    Wilson      Robert Wilson

## Categorize a numerical variable

In [64]:
# Minimum CholesterolBefore value
df.CholesterolBefore.min()

1.2

In [65]:
# Maximum CholesterolBefore value
df.CholesterolBefore.max()

11.1

In [66]:
# Create a new column called CholesterolBeforeLevel using the cut function with bins=[0,5,10,20], which is right False and has the labels ['low', 'normal', 'high']
df['CholesterolBeforeLevel'] = pd.cut(df.CholesterolBefore, bins=[0, 5, 10, 20], right=False, labels=['low', 'normal', 'high'])
df.CholesterolBeforeLevel[:5]

0    low
1    low
2    low
3    low
4    low
Name: CholesterolBeforeLevel, dtype: category
Categories (3, object): ['low' < 'normal' < 'high']

In [67]:
df['HRLevel'] = pd.cut(df.HR, bins = [0, 65, 78, 1000], right=True, labels=['low', 'normal', 'high'])
df.HRLevel[:5]

0    low
1    low
2    low
3    low
4    low
Name: HRLevel, dtype: category
Categories (3, object): ['low' < 'normal' < 'high']

## Missing Data

In [68]:
# Print the numpy nan value
np.nan

nan

In [69]:
# Create a list with three integers and a nan value and assign it to the variable my_list
my_list = [1, 2, 3, np.nan]
my_list

[1, 2, 3, nan]

In [70]:
# Calculate the mean of my_list
np.mean(my_list)

nan

In [71]:
# Read the MissingData.csv file and assign it to the variable df_missing
df_missing = pd.read_csv('https://raw.githubusercontent.com/juanklopper/TutorialData/main/MissingData.csv')

In [72]:
# Print the first 10 rows of df_missing
df_missing[:10]

    age   salary  previouscompany
0  57.0      NaN              1.0
1  56.0  50927.0              NaN
2  46.0  75500.0              3.0
3   NaN  84417.0              NaN
4  60.0  63002.0              1.0
5  54.0  54652.0              NaN
6   NaN  65739.0              1.0
7  64.0  89397.0              3.0
8  60.0  77797.0              4.0
9  61.0      NaN              1.0

In [73]:
# Delete rows with missing values and assign to a new variable complete_data_df
complete_data_df = df_missing.dropna()

In [74]:
# Use .isna() for the age column
df_missing.age.isna()

0     False
1     False
2     False
3      True
4     False
5     False
6      True
7     False
8     False
9     False
10    False
11     True
12    False
13    False
14    False
15     True
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
30    False
31    False
Name: age, dtype: bool

In [75]:
# Sum over all the missing data in the age column
df_missing.age.isna().sum()

4

In [76]:
# Use forward fill to impute the missing values in the age column
df_missing.age.fillna(method='ffill')[:5]

C:\Users\Pandey\AppData\Local\Temp\ipykernel_20148\170363983.py:2: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df_missing.age.fillna(method='ffill')[:5]

0    57.0
1    56.0
2    46.0
3    46.0
4    60.0
Name: age, dtype: float64

In [77]:
# Fill the missing age values with the median age
df_missing.age.fillna(df_missing.age.median())[:5]

0    57.0
1    56.0
2    46.0
3    57.0
4    60.0
Name: age, dtype: float64

In [78]:
# Import the DefaultMissingData.scv file and assign ot to the variable default_missing_df
default_missing_df = pd.read_csv('https://raw.githubusercontent.com/juanklopper/TutorialData/main/DefaultMissingData.csv')
default_missing_df[:5]

   age salary previous_company
0   57    Nil                1
1   56  50927          Missing
2   46  75500                3
3  999  84417          Missing
4   60  63002                1